Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t
Serialization structure for Profile Item cross section.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.Number
The cross section number.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.Location
The cross section location.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.ProfileType
The cross section type.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.ProfileSubType
The cross section sub type.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.EquivalentType
The cross section equivalent type.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.NumberOfProfileItemParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.ProfileItemParameters
Profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.NumberOfProfileItemAnalysisParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.ProfileItemAnalysisParameters
Profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.NumberOfProfileItemUserParameters
Number of profile item parameters.

Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t.ProfileItemUserParameters
Profile item parameters.